{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "use_bias": true, "batch_input_shape": [null, 128, 500, 1], "kernel_size": [32, 32], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_constraint": null, "name": "conv2d_1", "padding": "valid", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "padding": "valid", "kernel_size": [10, 10], "dilation_rate": [1, 1], "filters": 16, "bias_constraint": null, "name": "conv2d_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "sigmoid", "bias_constraint": null}}], "keras_version": "2.2.0"}